tutorials/compressible/steadyCompressibleMRFFoam/bentRotorStator/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        phi             phi;
        rho             none;
        psi             psi;
        U               U;
        gamma           1.4;
        T0              uniform 300;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
        value           $internalField;
    }

    bladeRotor
    {
        type            zeroGradient;
    }

    shaftRotor
    {
        type            zeroGradient;
    }

    shroudRotor
    {
        type            zeroGradient;
    }

    bladeStator
    {
        type            zeroGradient;
    }

    shaftStator
    {
        type            zeroGradient;
    }

    shroudStator
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
